{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "BatchNormalization",
      "config": {
        "axis": 1,
        "batch_input_shape": [
          null,
          1,
          48,
          48
        ],
        "beta_regularizer": null,
        "epsilon": 0.0001,
        "gamma_regularizer": null,
        "input_dtype": "float32",
        "mode": 0,
        "momentum": 0.99,
        "name": "batchnormalization_1",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "relu",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "border_mode": "valid",
        "dim_ordering": "th",
        "init": "glorot_uniform",
        "name": "convolution2d_1",
        "nb_col": 3,
        "nb_filter": 32,
        "nb_row": 3,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "axis": 1,
        "beta_regularizer": null,
        "epsilon": 0.0001,
        "gamma_regularizer": null,
        "mode": 0,
        "momentum": 0.99,
        "name": "batchnormalization_2",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "border_mode": "valid",
        "dim_ordering": "th",
        "name": "maxpooling2d_1",
        "pool_size": [
          3,
          3
        ],
        "strides": [
          3,
          3
        ],
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "relu",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "border_mode": "valid",
        "dim_ordering": "th",
        "init": "glorot_uniform",
        "name": "convolution2d_2",
        "nb_col": 3,
        "nb_filter": 64,
        "nb_row": 3,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "axis": 1,
        "beta_regularizer": null,
        "epsilon": 0.0001,
        "gamma_regularizer": null,
        "mode": 0,
        "momentum": 0.99,
        "name": "batchnormalization_3",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "border_mode": "valid",
        "dim_ordering": "th",
        "name": "maxpooling2d_2",
        "pool_size": [
          3,
          3
        ],
        "strides": [
          3,
          3
        ],
        "trainable": true
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "relu",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "init": "glorot_uniform",
        "input_dim": null,
        "name": "dense_1",
        "output_dim": 200,
        "trainable": true
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "p": 0.3,
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "axis": -1,
        "beta_regularizer": null,
        "epsilon": 0.0001,
        "gamma_regularizer": null,
        "mode": 0,
        "momentum": 0.99,
        "name": "batchnormalization_4",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "softmax",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "init": "glorot_uniform",
        "input_dim": null,
        "name": "dense_2",
        "output_dim": 7,
        "trainable": true
      }
    }
  ],
  "keras_version": "1.1.0"
}